app/views/users/show.html.erb

SELECT "gardens".* FROM "gardens" WHERE "gardens"."user_id" = ?  [["user_id", 1]]
---
<h3> Your gardens: </h3>
<% @user.user_gardens.each do |garden| %>