app/views/gardens/add_plant.html.erb

SELECT "plants".* FROM "plants" ORDER BY "plants"."tfvname" ASC
---
<%= form_tag("/gardens/#{@garden.id}/add_plant") do %>
    <%= collection_select :garden, :plant_ids, Plant.all.order(:tfvname), :id, :tfvname %><br>