app/views/gardens/edit.html.erb

SELECT "plants".* FROM "plants" INNER JOIN "garden_plants" ON "plants"."id" = "garden_plants"."plant_id" WHERE "garden_plants"."garden_id" = ?  [["garden_id", 6]]
---
  <label>Select by alternative name:</label><br>
  <% @garden.plants.each do |plant| %>