app/views/gardens/new.html.erb

  <label>Select by alternative name:</label><br>
  <%= f.collection_select :plant_id, Plant.all, :id, :tfvname %><br>
---
SELECT "plants".* FROM "plants" ORDER BY "plants"."tfvname" ASC