app/views/gardens/show.html.erb

<h3>Your garden contains these plants:</h3>
<% @garden.plants.each do |plant|%>
---
SELECT "plants".* FROM "plants" INNER JOIN "garden_plants" ON "plants"."id" = "garden_plants"."plant_id" WHERE "garden_plants"."garden_id" = ?  [["garden_id", 20]]