app/controllers/conditions_controller.rb

    def index
        @conditions = Condition.all
---
SELECT "conditions".* FROM "conditions"

    def set_condition
        @condition = Condition.find(params[:id])
---
SELECT "conditions".* FROM "conditions" WHERE "conditions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]