app/controllers/conditions_controller.rb

    def show
      @condition = Condition.find(params[:id])
---
SELECT "conditions".* FROM "conditions" WHERE "conditions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]