app/controllers/gardens_controller.rb

    def index
        @gardens = Garden.all
---
SELECT "gardens".* FROM "gardens"

    def create
        @garden = Garden.new(garden_params)
        @garden.user = current_user
        @garden.save
        @garden.plants << Plant.find(params[:garden][:plants].to_i)
---
INSERT INTO "gardens" ("name", "category", "user_id") VALUES (?, ?, ?)  [["name", "df"], ["category", "erg"], ["user_id", 2]]
INSERT INTO "plants" ("tfvname", "botname", "othname", "image_url") VALUES (?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "garden_plants" ("garden_id", "plant_id") VALUES (?, ?)  [["garden_id", 6], ["plant_id", 5]]
INSERT INTO "gardens" ("name", "category", "user_id", "plant_id") VALUES (?, ?, ?, ?)  [["name", "asdasd"], ["category", "asfdasd"], ["user_id", 10], ["plant_id", 1]]

    def update
        @garden.update(garden_params)
---
UPDATE "gardens" SET "name" = ? WHERE "gardens"."id" = ?  [["name", "asdsadasdasdasdsadasd"], ["id", 4]]

    def destroy
        @garden.destroy
---
DELETE FROM "gardens" WHERE "gardens"."id" = ?  [["id", 19]]

    def add_direct

        @garden.plants << Plant.find(params[:garden][:plant_ids])
---
INSERT INTO "garden_plants" ("garden_id", "plant_id") VALUES (?, ?)  [["garden_id", 20], ["plant_id", 6]]
SELECT "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

    def set_garden
        @garden = Garden.find(params[:id])
---
SELECT "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

    def garden_belongs_to_current_user?
        unless Garden.find(params[:id]).user == current_user
---
SELECT "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]