app/controllers/plants_controller.rb

    def index
        @plants = Plant.all
---
SELECT "plants".* FROM "plants"

    def set_plant
        @plant = Plant.find(params[:id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]