app/controllers/plants_controller.rb

    def index
        @plants = Plant.all.order(:tfvname)
---
SELECT "plants".* FROM "plants" ORDER BY "plants"."tfvname" ASC