app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "username", "password", "email", "bio", "country") VALUES (?, ?, ?, ?, ?, ?, ?)  [["first_name", "my"], ["last_name", "user"], ["username", "username1"], ["password", "password1"], ["email", "email@address.com"], ["bio", "bio goes here"], ["country", "uk"]]
---
    def create
        @user = User.create(user_params(:first_name, :last_name, :username, :password, :email, :bio, :country))

UPDATE "users" SET "username" = ?, "password" = ? WHERE "users"."id" = ?  [["username", "username999"], ["password", "123"], ["id", 1]]
---
    def update
        @user.update(user_params(:first_name, :last_name, :username, :password, :email, :bio, :country))